; domain
(define (domain remote-inspection)
(:requirements :typing)
(:types robot cell tank - object)

(:predicates 	
	(robot-at ?r - robot ?x - cell)
	(tank-at ?t - tank ?x - cell)
	(up ?x - cell ?y - cell)
	(down ?x - cell ?y - cell)
	(right ?x - cell ?y - cell)
	(left ?x - cell ?y - cell)
	(empty ?x - cell)
	(inspected ?t - tank)
	(radiation ?x - cell)
)

; Robot movements
(:action up 
  :parameters (?r - robot ?x - cell ?y - cell)
  :precondition (and (robot-at ?r ?x) (up ?x ?y) (empty ?y) (not (radiation ?y)))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (empty ?x) (not (empty ?y))
            )
)

(:action down 
  :parameters (?r - robot ?x - cell ?y - cell)
  :precondition (and (robot-at ?r ?x) (down ?x ?y) (empty ?y) (not (radiation ?y)))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (empty ?x) (not (empty ?y))
            )
)

(:action right 
  :parameters (?r - robot ?x - cell ?y - cell)
  :precondition (and (robot-at ?r ?x) (right ?x ?y) (empty ?y) (not (radiation ?y)))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (empty ?x) (not (empty ?y))
	     )
)

(:action left 
  :parameters (?r - robot ?x - cell ?y - cell)
  :precondition (and (robot-at ?r ?x) (left ?x ?y) (empty ?y) (not (radiation ?y)))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (empty ?x) (not (empty ?y))
            )
)

(:action inspect-up
  :parameters (?r - robot ?x - cell ?y - cell ?t - tank)
  :precondition (and (robot-at ?r ?x) (tank-at ?t ?y) (up ?x ?y) (not (inspected ?t)))
  :effect (and (inspected ?t)
            )
)

(:action inspect-down
  :parameters (?r - robot ?x - cell ?y - cell ?t - tank)
  :precondition (and (robot-at ?r ?x) (tank-at ?t ?y) (down ?x ?y) (not (inspected ?t)))
  :effect (and (inspected ?t)
            )
)

(:action inspect-right
  :parameters (?r - robot ?x - cell ?y - cell ?t - tank)
  :precondition (and (robot-at ?r ?x) (tank-at ?t ?y) (right ?x ?y) (not (inspected ?t)))
  :effect (and (inspected ?t)
            )
)

(:action inspect-left
  :parameters (?r - robot ?x - cell ?y - cell ?t - tank)
  :precondition (and (robot-at ?r ?x) (tank-at ?t ?y) (left ?x ?y) (not (inspected ?t)))
  :effect (and (inspected ?t)
            )
)

)

; problem
(define (problem p01)
 (:domain remote-inspection)
 (:objects cell_0-0 cell_1-0 cell_2-0 
           cell_0-1 cell_1-1 cell_2-1
           cell_0-2 cell_1-2 cell_2-2 - cell
           tank1 tank2 - tank
           rover - robot
)
 (:init 
   (robot-at rover cell_0-0)
   (tank-at tank1 cell_2-0)
   (tank-at tank2 cell_2-2)
   (empty cell_1-0)
   (empty cell_0-1)
   (empty cell_1-1)
   (empty cell_2-1)
   (empty cell_0-2)
   (empty cell_1-2)
   (up cell_0-1 cell_0-0)
   (up cell_0-2 cell_0-1)
   (up cell_1-1 cell_1-0)
   (up cell_1-2 cell_1-1)
   (up cell_2-1 cell_2-0)
   (up cell_2-2 cell_2-1)
   (down cell_0-0 cell_0-1)
   (down cell_0-1 cell_0-2)
   (down cell_1-0 cell_1-1)
   (down cell_1-1 cell_1-2)
   (down cell_2-0 cell_2-1)
   (down cell_2-1 cell_2-2)
   (right cell_0-0 cell_1-0)
   (right cell_1-0 cell_2-0)
   (right cell_0-1 cell_1-1)
   (right cell_1-1 cell_2-1)
   (right cell_0-2 cell_1-2)
   (right cell_1-2 cell_2-2)
   (left cell_1-0 cell_0-0)
   (left cell_2-0 cell_1-0)
   (left cell_1-1 cell_0-1)
   (left cell_2-1 cell_1-1)
   (left cell_1-2 cell_0-2)
   (left cell_2-2 cell_1-2)
   (radiation cell_2-1)
)
 (:goal (and
    (inspected tank1)
    (inspected tank2)
))
)

; plan
1. (right rover cell_0-0 cell_1-0)
   deleted: (robot-at rover cell_0-0) (empty cell_1-0)
   added: (robot-at rover cell_1-0) (empty cell_0-0)
   goals met: 0 of 2
2. (inspect-right rover cell_1-0 cell_2-0 tank1)
   added: (inspected tank1)
   goals met: 1 of 2
3. (down rover cell_1-0 cell_1-1)
   deleted: (robot-at rover cell_1-0) (empty cell_1-1)
   added: (robot-at rover cell_1-1) (empty cell_1-0)
   goals met: 1 of 2
4. (down rover cell_1-1 cell_1-2)
   deleted: (robot-at rover cell_1-1) (empty cell_1-2)
   added: (robot-at rover cell_1-2) (empty cell_1-1)
   goals met: 1 of 2
5. (inspect-right rover cell_1-2 cell_2-2 tank2)
   added: (inspected tank2)
   goals met: 2 of 2
